using System;
using System.Threading;

namespace N_005_Thread_Foreground
{
    /// <summary>
    /// Примеры типов потоков
    /// Foreground - Будет работать после завершения работы первичного потока
    /// Background - Завершает работу вместе с первичным потоком 
    /// </summary>
    class Program
    {
        private static void Procedure()
        {
            for (int i = 0; i < 500; i++)
            {
                Thread.Sleep(10);
                Console.Write(".");
            }
            
            Console.WriteLine("\nЗавершение второго потока.");
        }
        
        static void Main(string[] args)
        {
            var thread = new Thread(Procedure);
            thread.Start();

            // Теперь поток стал фоновым
            // и приложение завершится сразу после завершения основного потока
            thread.IsBackground = true;
            
            // По умолчанию - thread.IsBackground = false;
            
            Thread.Sleep(500);
            
            Console.WriteLine("Завершение основного потока");
        }
    }
}

// Результат (thread.IsBackground = true):
// ................................Завершение основного потока

// Результат (thread.IsBackground = false):
// .................................Завершение основного потока
// .....................................................................................................................................................................................
// .....................................................................................................................................................................................
// .........................................................................................................
// Завершение второго потока.